[{"id":"destinations1","category":"destinations","rank":1,"location":"1. Cuba","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/8f\/52\/caption.jpg","description":"U.S. citizens still need to jump through a few hoops to visit Cuba, but as visitors from around the world know, this island offers some amazing opportunities for cultural exchange. Havana is a mix of old-world architecture and of-the-moment culture. Head out of the capital city to the small town of Trinidad to see more Spanish colonial architecture. It’s a UNESCO World Heritage Site and a fantastic home base for a visit to the Valley of the Sugar Mills, a pocket of land that formerly served as the center of Cuba’s sugar industry.","latitude":32.902492,"longitude":-105.946112},{"id":"destinations2","category":"destinations","rank":2,"location":"2. Hoi An, Vietnam","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/87\/cc\/caption.jpg","description":"This city on the central Vietnamese coast is a well-preserved example of the important Southeast Asian trading port it was from the 15th-19th centuries. Already a common stop for backpackers, it is becoming better known to tourists. On the 14th day of each lunar month, the town trades its electric lights for traditional colored lanterns. Sights include the Japanese Covered Bridge and the Quan Cong Temple. Let the town’s expert tailors make you some bespoke clothing.","latitude":15.8798137,"longitude":108.3273939},{"id":"destinations3","category":"destinations","rank":3,"location":"3. Mauritius, Africa","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/97\/21\/caption.jpg","description":"Mauritius is arguably Africa’s wealthiest destination, a tropical paradise with tons to do. Port Louis, the modern capital of this 38-mile by 29-mile island, is a bustling port with a revitalized waterfront and a busy market. But most visitors gravitate toward resort areas such as Mont Choisy, quiet Trou-aux-Biches and the more bustling Flic en Flac, popular with scuba divers. Rivière Noire is ideal for those looking for great deep-sea fishing.","latitude":52.490175,"longitude":4.932979},{"id":"destinations4","category":"destinations","rank":4,"location":"4. Siem Reap, Cambodia","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/88\/02\/caption.jpg","description":"When the morning light washes over the overgrown temples and ruins of Angkor Wat, a simple Siem Reap sunrise becomes a profound event. The ancient structures are contained within one of the largest religious complexes in the world. The complex and the 12th century Angkor Thom royal city are considered the main reasons to visit Siem Reap. Get a lesson in national history at the Cambodian Cultural Village, and a lesson in bargaining at the Angkor Night Market, a bonanza of shopping stalls, food vendors, and bars.","latitude":13.3468847,"longitude":103.8562184},{"id":"destinations5","category":"destinations","rank":5,"location":"5. Chiang Mai, Thailand","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/88\/6a\/caption.jpg","description":"You could spend your whole Chiang Mai vacation exploring the famous Night Bazaar. Once you’ve exhausted the art of the cheerful haggle, however, there’s plenty more to explore. The National Museum and Botanic Garden are great places to soak up some local culture and to breathe in the delicate fragrance of Thai orchids. In the city’s center, the remains of ancient walls embrace over 30 temples. Limber travelers can climb 300 stairs to Wat Phrathat Doi Suthep, an ornate Buddhist temple in the hills.","latitude":18.769317,"longitude":98.9678167},{"id":"destinations6","category":"destinations","rank":6,"location":"6. Grand Cayman, Cayman Islands","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/99\/6d\/caption.jpg","description":"The farther you go from Grand Cayman's busy docks, the more peace and quiet you'll find. At Stingray City (actually a sandbar), stingrays swim alongside you in the tranquil waters. Closer to town, travelers report finding some of the best massage and spa services anywhere in the Caribbean.","latitude":19.331873,"longitude":-81.381505},{"id":"destinations7","category":"destinations","rank":7,"location":"7. Fes, Morocco","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/8a\/70\/caption.jpg","description":"The oldest university in the world isn’t Oxford or the Sorbonne—it’s the University of Al-Karaouine, and you’ll find it in Fes el Bali. This walled city, a UNESCO World Heritage Site, will transport you back to medieval times. Visit the ancient maze-like quarters of the Medina to Fes el-Bali and the four imposing Gates of Fes, with their distinctive Moroccan tile work. You can walk, or, if you're brave, take a taxi—the daredevil drivers will have you hanging on for dear life.","latitude":34.021725,"longitude":-5.034441},{"id":"destinations8","category":"destinations","rank":8,"location":"8. Baku, Azerbaijan","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/8a\/97\/caption.jpg","description":"The historical center of Baku reveals its tumultuous past, from its roots as a Silk Road port city, through its oil boom to its Soviet period. The old city is a maze of alleys, mosques, historic buildings and remnants of fortification, including the Palace of the Shirvanshahs and the Maiden Tower, now listed among UNESCO's World Heritage Sites. Much more than a historic site, the city hosts vibrant arts and cultural activities, as well as a bustling modern business sector.","latitude":40.39685785,"longitude":49.95548677},{"id":"destinations9","category":"destinations","rank":9,"location":"9. Kathmandu, Nepal","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-w\/27\/c3\/97\/e0\/caption.jpg","description":"Nepal’s capital is surrounded by a valley full of historic sites, ancient temples, shrines, and fascinating villages. Mingle with locals and animals amid Durbar Square’s monuments, or join mountain trekkers in the bustling Thamel District. Explore shops for exquisite work by local artisans—carpets and paper prints are specialties.","latitude":27.7013346,"longitude":85.3583225},{"id":"destinations10","category":"destinations","rank":10,"location":"10. Krakow, Poland","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-p\/27\/c3\/8a\/d1\/caption.jpg","description":"The Wawel Castle, Main Square, St. Mary's Church and Kazimierz District...Krakow, the city entered into the first list of the UNESCO World Heritage Sites, offers a wealth of history and architecture. A city for centuries appreciated for its cultural heritage has also become a European center of gastronomic heritage. In 2019, the city of Kraków was granted the title of European Capital of Gastronomic Culture by the European Academy of Gastronomy.\nKrakow is the city living a full cultural life. Each year, the capital of Lesser Poland hosts nearly 100 festivals and other international-scale events.","latitude":50.0615393,"longitude":19.9373},{"id":"destinations11","category":"destinations","rank":11,"location":"11. Ho Chi Minh City, Vietnam","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/41\/8f\/47\/saigon-by-night.jpg","description":"Vietnam's bustling largest city sets the cultural and economic pace for the country. The former Saigon boasts charming French colonial architecture and wide boulevards, usually thronged and choked with traffic. Taxis are an option for seeing the sprawling city. The War Remnants Museum shows the Vietnam War through Vietnamese eyes. Don't miss the impressive Jade Emperor Pagoda. Go to the frenetic Ben Thanh Market for food, flowers or frogs. Tour through the Mekong Delta, past rice paddies and houseboats. ","latitude":10.787466,"longitude":106.664324},{"id":"destinations12","category":"destinations","rank":12,"location":"12. Lanzarote, Canary Islands","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-w\/22\/58\/46\/14\/verso-il-lago-verde.jpg","description":"Ahhh, Lanzarote: The Canary Island paradise where you can ride a camel into the sunset and then dine inside a candlelit cave. The rock formations of Los Hervideros will take your breath away, as will the views from the Mirador del Rio lookout point. Legend has it that locals would hide from pirates in the underground caverns of Cueva de los Verdes, which are now open to curious visitors. Above ground the Jardin de Cactus will teach you all about the spiny desert plants.","latitude":37.873605,"longitude":-122.235964},{"id":"destinations13","category":"destinations","rank":13,"location":"13. Santiago, Chile","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-w\/1c\/a6\/ea\/8d\/a-panorama-across-the.jpg","description":"Santiago is one of those metropolitan joys where the more you look, the more you find. Funky cafes and dance clubs dot Bellavista, Forest Park art collections range from pre-Columbian to contemporary, and architecture runs the gamut from the 16th-century San Francisco Church to mirrored office towers. Shop with the locals at Mall Panora¡mico and give your palate meals to remember with hearty Chilean fare.","latitude":-33.4428756,"longitude":-70.6918529},{"id":"destinations14","category":"destinations","rank":14,"location":"14. Juneau, Alaska","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/8b\/00\/caption.jpg","description":"Because of its ideal location between the base of Mount Juneau and the Gastineau Channel, the Southeastern Alaskan city of Juneau has been the home of Native American fisherman, European fur traders, and American gold prospectors. Now a free-spirited state capital, Juneau is the perfect base for a journey into the gorgeous Alaskan wilderness, whether it's for fishing, kayaking, and dog sledding in the National Parks, whale-watching at Icy Strait, or glacier hiking at the Juneau Icefield. ","latitude":58.3019496,"longitude":-134.419734},{"id":"destinations15","category":"destinations","rank":15,"location":"15. Panama City, Panama","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/22\/80\/2f\/74\/caption.jpg","description":"A diverse multicultural city of almost 1.3 million, Panama City offers a lot more than an up-close view of the Canal. Shantytowns slink up alongside shiny high-rise condos. The Old City is an atmospheric labyrinth of churches, plazas and palaces. Fifteen miles from downtown Panama City, Soberania National Park is an excellent destination for hiking and birding. For a fascinating look at the canal, take a taxi or local bus to Miraflores Locks Visitor Center and look down on the traffic below. ","latitude":8.9714493,"longitude":-79.5341802},{"id":"destinations16","category":"destinations","rank":16,"location":"16. Panay Island, Visayas","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/1c\/b2\/1a\/c7\/lone-palm-tree-white.jpg","description":"Most travelers know Panay as the jumping-off point for the white-sand, turquoise-water beaches in Boracay. But if you’ve got a few extra days to explore, you’ll find a whole lot more to the Filipino island—from the rugged mountains and rivers of Antique to the history and architecture of Iloilo City. It’s also a food-lover’s dream: Dig into the best seafood in the country (some travelers say) at Baybay Beach or hop over to Guimaras Island to try some of the sweetest mangoes in the world.","latitude":13.96521,"longitude":124.330195},{"id":"destinations17","category":"destinations","rank":17,"location":"17. Lombok, West Nusa Tenggara","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/c3\/98\/c9\/caption.jpg","description":"If it were located anywhere else in the world, Lombok would be on everyone’s bucket list. But because it’s just east of Bali, fewer people have heard of its secluded coves, endless string of cream-colored beaches, and waterfalls crashing through its impossibly lush foliage. Fine with us, because that means it’s also less crowded. You can spot wild macaques in the trees of Baun Pusak or float with the green and hawksbill turtles around Gili Meno without feeling like there’s a line behind you. This Indonesian island has a high point that Bali can’t match: Mount Rinjani, an active volcano with a massive lake inside its caldera. An early morning hike lets you watch the sun rise over the sea.","latitude":-8.706904,"longitude":116.562447},{"id":"destinations18","category":"destinations","rank":18,"location":"18. Ilha do Sal, Cape Verde","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/27\/6d\/ff\/b8\/the-pier-of-santa-maria.jpg","description":"The Cape Verdean island of Sal is all about the beach, baby. White sand stretches along glassy turquoise waters—perfect for a lazy day of sunning or some heart-pumping watersports. Snorkelers and divers will find plenty of tropical fish, turtles, and dolphins to look at. On dry land, kids (and grownups!) will marvel at the Terra Boa mirage, an optical illusion that conjures a peaceful-looking lake in the middle of a large, flat plain.","latitude":16.6004453,"longitude":-22.9013825},{"id":"destinations19","category":"destinations","rank":19,"location":"19. Vienna, Austria","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/1b\/1b\/03\/55\/waltz-your-way-through.jpg","description":"In Vienna, the coffee house isn’t just a hangout: it’s an institution. Lingering over a newspaper with a pastry and a strong espresso drink is, according to UNESCO, officially a Viennese cultural pastime. Walk off your slice of Sachertorte with a self-guided tour of the city’s stunning traditional, Secessionist, and modern architecture, such as the Imperial Palace, the State Opera House, the Kirche am Steinhof, or the Kunsthistorisches Museum, an exercise in ornate geometry. ","latitude":48.2446125,"longitude":16.33457242},{"id":"destinations20","category":"destinations","rank":20,"location":"20. Paphos, Cyprus","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/01\/36\/30\/47\/ruins-at-paphos-harbour.jpg","description":"Located on the southwest coast of the island of Cyprus, Paphos (Pafos) boasts a temperate climate and one of the healthiest lifestyles in the Mediterranean.\nPaphos (Pafos) is ideal for basking in the sunshine all year round, and experience the hospitality of its people wherever you go. Plunge into the sparkling warm waters of the Mediterranean in summer, or venture out on a splendid nature trail and observe fields blanketed in wildflowers in the spring; visit ancient and historical landmarks in autumn, and keep fit with a plethora of outdoor activities in winter. Whichever way you look at it, Paphos (Pafos) is a year-round destination with many reasons to visit.\nThe Pafos (Paphos) Region caters for all types of vacationers in search of something unique, while revealing in the culture and local traditions. It offers the most idyllic and romantic settings to commemorate your love, or create lifetime memories for the whole family!","latitude":34.7743988,"longitude":32.4231586},{"id":"destinations21","category":"destinations","rank":21,"location":"21. Agadir, Morocco","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/19\/c4\/6a\/77\/the-beach-of-taghzout.jpg","description":"Soak up the sun on the well-maintained beaches of Agadir, southern Morocco's most-visited city. Palm-lined boulevards and beachfront bars add a decidedly Western-resort feel, amplified by the large number of Europeans who flock here in the winter months. It’s all about laid-back relaxation in Agadir, so ride a camel, rent a beach buggy, check out the Suq al-Had market or take the 20-minute walk up to the ruins of the Agadir Kasbah for expansive city views if you’re taking a break from the beach.","latitude":30.4211144,"longitude":-9.5830626},{"id":"destinations22","category":"destinations","rank":22,"location":"22. Marmaris, Turkiye","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/21\/aa\/9e\/ac\/marmaris.jpg","description":"A gorgeous backdrop of pine-clad mountains looms behind the seaside resort of Marmaris in southwest Turkey. Popular as a cruise ship and yacht port and with the British budget holiday crowd, Marmaris offers an abundance of fast food restaurants, the restored castle of Suleyman the Magnificent and an appealing cobblestoned old quarter. Outside the busy town, coves and bays of the Datça Peninsula make lovely daytrip destinations for those traveling by boat.","latitude":36.8522547,"longitude":28.2742661},{"id":"destinations23","category":"destinations","rank":23,"location":"23. Bucharest, Romania","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/14\/10\/2e\/19\/bucharest.jpg","description":"Vlad the Impaler stated his claim to Bucharest in 1459. His citadel on the Dambovita was the first of flotillas of palaces, many of which still stand. Four subway lines and a modern bus network transport visitors and commuters. Nicknamed \"Little Paris\", Bucharest's elegant early 20th-century architecture shows French influences. Don't miss the Village Museum, Romanian Athenaeum and the Peasant Museum. You can't miss the Palace of Parliament, the second-largest building in the world (after the Pentagon).","latitude":44.4962769,"longitude":26.0827318},{"id":"destinations24","category":"destinations","rank":24,"location":"24. Brussels, Belgium","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/17\/a2\/64\/a3\/you-are-very-welcome.jpg","description":"Unassuming Brussels is the capital of Belgium, Flanders and Europe. Medieval Grand-Place, is indeed grand, with many 17th-century buildings and daily flower markets. Reopened in 2006, the Atomium, Brussels' Eiffel Tower, provides great views, inside and out. Architecture fans should visit Musee Horta, home of Belgian master architect Victor Horta. St. Gery's clubs and bars are packed year-round. Seafood eateries abound in Ste. Catherine. Walk, rather than get snarled up in traffic, in the narrow streets.","latitude":50.8407897,"longitude":4.4667578},{"id":"destinations25","category":"destinations","rank":25,"location":"25. Copenhagen, Denmark","imageurl":"https:\/\/media-cdn.tripadvisor.com\/media\/photo-s\/18\/52\/d4\/52\/nos-levantamos-adoptando.jpg","description":"Copenhagen was once a Viking fishing settlement, and you can still find traces of the Norse explorers here. Visit reconstructed villages, the remains of a 1,000-year-old castle, and museums dedicated to the notorious raiders. Copenhagen also features a blend of modern architecture and historical artifacts such as the Round Tower observatory – a wonderful example of 17th-century architecture. Art galleries, narrow streets, canals, parks, and Baroque churches round out the city’s cultural attractions.","latitude":55.6867243,"longitude":12.5700724}]